## "Кратные пяти из диапазона"

### Задание

Даны два целые числа a и b.

Выведите на экран все целые **кратные 5** от a до b включительно.

### Формат входных данных

Даны два целые числа. **Не гарантируется**, что a < b. \
Если a > b, то выводим все числа из диапазона [b, a].

### Формат выходных данных

Выведите все числа, требуемые по условию задачи.

### Решение задачи

```python
arr_start = int(input('начало диапазона: '))
arr_end = int(input('конец диапазона: '))
if arr_start > arr_end:
    arr_start, arr_end = arr_end, arr_start
while arr_start <= arr_end:
    if arr_start % 5 == 0:
        print(arr_start)
    arr_start += 1
```
