## "Бесконечный ввод и подсчет положительных"

### Задание

С клавиатуры вводятся целые числа, до тех пор пока не будет введена строка "стоп". \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Вводятся целые числа, пока не будет введено "стоп".

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
stop_input = 'стоп'
cur_input = ''
positive_c = int(0)
while stop_input != cur_input:
    cur_input = input('введите число или "стоп": ')
    if stop_input != cur_input and int(cur_input) > 0:
        positive_c += 1
print('число положительных: ', positive_c)
```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Выполнение цикла пока не будет введено нужное значение"
</details>
